{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/delightful",
  "1.18.2": {
    "1.0": "Initial Release.",
    "1.1": "Added Crab Rangoon, Prickly Pear Juice, Chunkwich, Tin Knife.",
    "1.2": "Added Silver & Brass Knives, Jelly Bottle.",
    "1.3": "Added Bone Knife, Nut Butter Bottle.",
    "1.4": "Added Nut Butter and Jelly Sandwich, Ender Nectar.",
    "1.5": "Added Quartz Cabinet. (Broken).",
    "1.5.1": "Fixed block drops for Quartz Cabinet. (Still broken).",
    "1.5.2": "Actually fixed block drops for Quartz Cabinet.",
    "1.6": "Added Basalt Cabinet, Constantan Knife, Electrum Knife, Invar Knife, Lead Knife, Nickel Knife.",
    "1.7": "Added configuration file. Fixed some recipes and item properties.",
    "1.8": "Added Azalea Tea & Honey Glazed Walnut (Thanks snommersnommers!). Added Green Tea Leaf and Chunk Nugget.",
    "1.9": "Added Salmonberry, Matcha, Matcha Latte, Berry Matcha Latte, Animal Fat, Animal Oil Bottle.",
    "1.10": "Added Cactus Flesh, Cactus Steak, Glow Jelly Bottle, Salmonberry Sack, Mini Melon, Lavender Tea, Chopped Clover, Field Salad, Rock Candy.",
    "1.11": "Fix crash with some languages, add tag support for Sprout and other mods.",
    "1.12": "Add support for Create's Rose Quartz. Fix some console logs.",
    "2.0": "Added some compat mobs to fatty_animals tag. Add Twilight Forest's Torchberries to berries tag. Removed Cultural Delights recipe override."
  },
  "1.19": {
    "2.0": "Updated to 1.19",
    "2.1": "Added some compat mobs to fatty_animals tag. Add Twilight Forest's Torchberries to berries tag. Removed Cultural Delights recipe override.",
    "2.2": "Added Acorn, Salmonberry Pips (for growing). More compat fatty_animals. Minor tag, loot modifier, and recipe fixes.",
    "2.3": "Added Twilight Forest knives. Added smelting/blasting knife into compat Diamond Nuggets. Minor recipe changes.",
    "2.4": "Fixed Twilight Forest knives missing abilities, and the recipe for the Fiery Knife.",
    "2.5": "Added knives from Forbidden and Arcanus and Roots Classic. Added some more recipe compat. Changed a few textures.",
    "2.6": "Update knife recipes to FD 1.2. Added (disabled by default) Emerald and Amethyst knives. Added Acorn Sack, Raw/Cooked Goat, Raw/Cooked Venison Chops.",
    "3.0": "Added slicing of some melons/gourds. Added Salmonberry Pie, Salmonberry Ice Cream. Added compat for Ars Nouveau, with an FD-style overhaul of their Source Berry Pie. Added overhaul of vanilla Pumpkin Pie. Added knives from SimpleOres and Fusion. Textures changes, fixes.",
    "3.1": "Pie overhaul for four pies from Oh the Biomes You'll Go. Added Pendorite & Allthemodium Knives. Added Matcha Ice Cream. Added Fixed Onyx Knife recipe.",
    "3.1.1": "Added Warden Knife. Fixed Matcha Ice Cream using wrong food. Minor tag changes and cleanup.",
    "3.1.2": "Added Zinc Knife, Gilded Quartz Knife, Leaf Knife, Kiwano Knife. Moved Lapis Lazuli Knife to disabled by default. Cleanup and tags. Add chinese translation.",
    "3.1.3": "Fixed crash with Farmer's Respite and enhanced compat. Fixed some possible datapack bugs. Minor tag changes.",
    "3.1.4": "Removed disabled items from Creative Tab and JEI. Override some recipes from Wild Berries. Fix venison chops dupe.",
    "3.2": "Added Coconut Curry & Sinigang.",
    "3.2.1": "Renamed Goat to Chevon and updated texture. Slightly changed Sinigang texture. Recipe, tag, and other miscellaneous fixes.",
    "3.2.2": "Wandering Trader support, Salmonberries require rain.",
    "3.2.3": "Added Matcha and Salmonberry Ice Cream block, Salmonberries provide Water Breathing.",
    "3.2.4": "Recipe and tag fixes.",
    "3.3.1": "https://github.com/brnbrd/Delightful/blob/1.19.2/changelog.md"
  },
  "promos": {
    "1.18.2-latest": "2.0",
    "1.18.2-recommended": "2.0",
    "1.19-latest": "3.3.1",
    "1.19-recommended": "3.3.1"
  }
}
